# ConduitSizes Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConduitSizes Methods
ConduitSizes Class See Also
---
The ConduitSizes type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Contains | Checks whether a conduit size with the nominal diameter exists. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetConduitSizesIterator | Returns a ConduitSizeIterator to the conduit sizes. |
| GetEnumerator | Returns an enumerator that iterates through a collection. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ConduitSizes Class
Autodesk.Revit.DB.Electrical Namespace